package com.study;

import java.sql.Connection;
import java.sql.PreparedStatement;
import java.util.Random;

import com.study.DBUtil;

public class DummyData {
	
	public static void main(String[] args) {
		
		//데이터 생성 
		
		//1. 지하철 역 , tblStation
		//station();
		
		//2. 호선 , tblLine
		//line();
		
		//3. 호선+역 , tblLineStation
		//lineStation();
		
		
		
	}

	private static void lineStation() {
		
		Connection conn = null;
		PreparedStatement stat = null;
		DBUtil util = new DBUtil();
		
		Random rnd = new Random();

		//a. 문위치
		String[] door = {"왼쪽","오른쪽"};
		
		//b. 환승구간
		String[] trans = {"1-1","1-2","1-3","1-4","1-5","1-6","1-7","1-8","1-9"
						  ,"2-1","2-2","2-3","2-4","2-5","2-6","2-7","2-8","2-9"
						  ,"3-1","3-2","3-3","3-4","3-5","3-6","3-7","3-8","3-9"
						  ,"4-1","4-2","4-3","4-4","4-5","4-6","4-7","4-8","4-9"
						  ,"5-1","5-2","5-3","5-4","5-5","5-6","5-7","5-8","5-9"};
		
		try {
			
			conn = util.open();
			
			String sql = ("insert into tblLineStation (seq, door, turn, transdoor, lineseq, staseq) values (lsseq.nextVal , ?, ?, ?, ?, ?)");
			
			//door : 왼쪽 , 오른쪽 랜덤 지정 
			stat.setString(1, door[rnd.nextInt(door.length)]);
			
			//turn : 역 순서
			stat.setString(2, "");
			
			//transdoor : 환승구간 랜덤 지정
			stat.setString(3, trans[rnd.nextInt(trans.length)]);
			
			//lineseq : 호선 번호 (FK)
			//14개 호선 
			//직접 입력
			stat.setString(4, "");
			
			//staseq : 역 번호 (FK)
			//직접 입력
			stat.setString(5, "");
			
			
			
			
		} catch (Exception e) {
			e.printStackTrace();
		}
		
		
	}//lineStation
	
	
	
	

	private static void line() {
		
		
		Connection conn = null;
		PreparedStatement stat = null;
		DBUtil util = new DBUtil();
		
		
		String[] lineList = {"1호선","1호선 급행","2호선","3호선","4호선","4호선 급행","5호선","6호선"	,"7호선","8호선"
							,"9호선","9호선 급행","경의중앙선","경의중앙선 급행"};
		
		
		try {
			
			conn = util.open();
			
			//for(int i=0; i<lineList.length; i++) {
				
				String sql = ("insert into tblLine (seq, name) values (lineseq.nextVal , ?, ?)");
				
				//호선 
				//몇개 없으니까 직접 입력하자 
				//stat.setString(1, lineList[i]);
				stat.setString(1, lineList[0]);
				
				//호선에 해당하는 방면  > 직접 입력
				//1호선(*) : 소요산방면(나머지4개 방면에서 출발하는거 다,,? 다!!!!) / 인천방면  / 광명방면  / 서동탄방면 / 신창방면 
				//2호선(*) : 신설동순환 / 까치산순환
				//3호선  : 오금방면 / 대화방면 
				//4호선 : 당고개방면 / 오이도방면
				//5호선(*) : 방화방면 / 상일동방면 / 마천방면
				//6호선(*) : 내선순환 1개 
				//7호선 : 장암방면 / 부평구청방면 
				//8호선  : 암사방면 / 모란방면 
				//9호선  : 개화방면 / 중앙보훈병원방면
				//경의중앙선(*) : 임진강방면 / 서울역방면 / 지평방면  
				stat.setString(2, "");
				
				stat.executeQuery();
				
				System.out.println("성공!");
			
			//}
			
					
			
		} catch (Exception e) {
			e.printStackTrace();
		}
		
		
		
	}//line
	
	
	
	

	private static void station() {
		
		Connection conn = null;
		PreparedStatement stat = null;
		DBUtil util = new DBUtil();
		
		
		String[] station1 = {"소요산","동두천","보산","동두천중앙","지행","덕정","덕계","양주","녹양","가능","의정부","회룡","망월사","도봉산","도봉"
				,"방학","창동","녹천","월계","광운대","석계","신이문","외대앞","회기","청량리","제기동","신설동","동묘앞","동대문","종로5가","종로3가"
				,"종각","시청","서울역","남영","용산","노량진","대방","신길","영등포","신도림","구로","구일","개봉","오류동","온수","역곡","소사","부천"
				,"중동","송내","부개","부평","백운","동암","간석","주안","도화","제물포","도원","동인천","인천","가산디지털단지","독산","금천구청","광명"
				,"석수","관악","안양","명학","금정","군포","당정","의왕","성균관대","화서","수원","세류","병점","서동탄","세마","오산대","오산","진위"
				,"송탄","서정리","지제","평택","성환","직산","두정","천안","봉명","쌍용","아산","배방","온양온천","신창"};
		
		
		
		String[] station2 = {"신설동","용두","신답","용답","성수","건대입구","구의","강변","잠실나루","잠실","잠실새내","종합운동장","삼성","선릉","역삼"
				,"강남","교대","서초","방배","사당","낙성대","서울대입구","봉천","신림","신대방","구로디지털단지","대림","도림천"
				,"양천구청","신정네거리","까치산","문래","영등포구청","당산","합정","홍대입구","신촌","이대","아현","충정로","을지로입구"
				,"을지로3가","을지로4가","동대문역사문화공원","신당","상왕십리","왕십리","한양대","뚝섬"};
		
		String[] station3 = {"대화","주엽","정발산","마두","백석","대곡","화정","원당","원흥","삼송","지축","구파발","연신내","불광","녹번","홍제","무악재"
				,"독립문","경복궁","안국","종로3가","충무로","동대입구","약수","금호","옥수","압구정","신사","잠원","고속터미널"
				,"남부터미널","양재","매봉","도곡","대치","학여울","대청","일원","수서","가락시장","경찰병원","오금"};
		
		
		
		String[] station4 = {"당고개","상계","노원","창동","쌍문","수유","미아","미아사거리","길음","성신여대입구","한성대입구","혜화","충무로"
				,"명동","회현","숙대입구","삼각지","신용산","이촌","동작","총신대입구","남태령","선바위","경마공원","대공원","과천","정부과천청사"
				,"인덕원","평촌","범계","산본","수리산","대야미","반월","상록수","한대앞","중앙","고잔","초지","안산","신길온천","정왕","오이도"};
		
		
		
		String[] station5 = {"방화","개화산","김포공항","송정","마곡","발산","우장산","화곡","신정","목동","오목교","양평","영등포시장","여의도","여의나루"
				,"마포","공덕","애오개","서대문","광화문","청구","신금호","행당","마장","답십리","장한평","군자","아차산","광나루","천호"
				,"강동","길동","굽은다리","명일","고덕","상일동","둔촌동","올림픽공원","방이","개롱","거여","마천"};
		
		
		String[] station6 = {"구산","독바위","역촌","응암","새절","증산","디지털미디어시티","월드컵경기장","마포구청","망원","상수","광흥창","대흥","효창공원앞"
				,"녹사평","이태원","한강진","버티고개","창신","보문","안암","고려대","월곡","상월곡","돌곶이","태릉입구","화랑대","봉화산","신내"};
		
		
		String[] station7 = {"장암","수락산","마들","중계","하계","공릉","먹골","중화","상봉","면목","사가정","용마산","중곡","어린이대공원","뚝섬유원지"
				,"청담","강남구청","학동","논현","반포","내방","남성","숭실대입구","상도","짐승배기","신대방사거리","보라매","신풍","남구로",
				"철산","광명사거리","천왕","까치울","부천종합운동장","춘의","신중동","부천시청","상동","삼산체육관","굴포천","부평구청"};
		
		
		String[] station8 = {"암사","강동구청","몽촌토성","석촌","송파","문정","장지","복정","산성","남한산성입구","단대오거리","신흥","수진","모란"};
		
		
		
		String[] station9 = {"개화","공항시장","신방화","마곡나루","양천향교","가양","증미","등촌","염창","신목동","선유도","국회의사당","샛강","노들","흑석"
				,"구반포","신반포","사평","신논현","언주","선정릉","삼성중앙","봉은사","삼전","석촌고분","송파나루","한성백제","둔춘오륜","중앙보훈병원"};
		
		
		String[] stationCentral = {"임진강","문산","파주","월롱","금촌","금릉","운정","야당","탄현","일산","풍산","백마","곡산","능곡","행신","강매","화전"
				,"수색","신촌(경의중앙)","서강대","서빙고","한남","응봉","중랑","망우","양원","구리","도농","양정","덕소","도심"
				,"팔당","운길산","양수","신원","국수","아신","오빈","양평","원덕","용문","지평"};
		
		
		try {
			
			
			conn = util.open();
			
			//1~9 , stationCentral 까지 한번씩 수정하고 실행하기
			for(int i=0; i<station1.length; i++) {
			
				String sql = ("insert into tblStation (seq , name) values (staseq.nextVal , ?)");
				
				stat.setString(1, station1[i]);
				
				stat.executeQuery();
				
				System.out.println("성공!");
				
			
			}
			
			stat.close();
			conn.close();
			
			
		} catch (Exception e) {
			e.printStackTrace();
		}
		
		
		

	
	}//station
	
	
	

}
